In [12]:
# !conda install sqlalchemy --y

In [17]:
import pandas as pd
import sqlalchemy as sql

In [18]:
connect_string = 'mysql://root:admin123@localhost/umls'

In [19]:
sql_engine = sql.create_engine(connect_string)

## Concept

In [20]:
# query = "SELECT CUI, TTY, SUI, STR, AUI, SCUI FROM MRCONSO WHERE SUPPRESS='N' AND LAT = 'ENG' AND TS = 'P' AND ISPREF = 'Y' AND SAB ='SNOMEDCT_US'"

# query = """
# SELECT MRCONSO.CUI, TTY, SUI, STR, AUI, TUI, STN, STY FROM MRCONSO 
# left join MRSTY on MRCONSO.CUI = MRSTY.CUI 
# WHERE SUPPRESS='N' AND LAT = 'ENG' AND TS = 'P' AND ISPREF = 'Y' AND SAB ='SNOMEDCT_US'
# """
query = "SELECT CUI, TTY, SUI, STR, AUI, SCUI FROM MRCONSO WHERE SAB ='SNOMEDCT_US'"


df = pd.read_sql_query(query, sql_engine)

In [21]:
df.head()

,CUI,TTY,SUI,STR,AUI,SCUI
0,C0319824,FN,S3204998,Caloscypha fulgens (organism),A10868589,420643001
1,C0006864,FN,S3205841,Cannabinoid (substance),A10868616,421921003
2,C0201945,FN,S3213573,Cerebrospinal fluid protein electrophoresis (p...,A10868693,77161005
3,C0013336,FN,S3235999,Constitutional short stature (disorder),A10868877,422065006
4,C0600203,FN,S3257200,Dichloroacetic acid (substance),A10869342,421675006

In [22]:
df.shape

(1434271, 6)

In [23]:
df.to_csv('concepts.csv', index=None)

In [24]:
con = pd.read_csv('concepts.csv')

In [25]:
con = con.set_index('CUI')

In [26]:
con = con.sort_index()

In [27]:
con.shape

(1434271, 5)

## Some concepts have multiple strings

In [28]:
con.loc['C1635169']

,TTY,SUI,STR,AUI,SCUI
CUI,,,,,
C1635169,SY,S6702067,mL/L,A9421794,418342002
C1635169,SYGB,S6690482,Microlitre/mL,A9410186,418342002
C1635169,SY,S6690480,Microliter/milliliter,A9410184,418342002
C1635169,SY,S6690477,Microliter per milliliter,A9410181,418342002
C1635169,SYGB,S6690481,Microlitre per millilitre,A9410185,418342002
C1635169,FN,S6690479,Microliter/milliliter (qualifier value),A9410183,418342002
C1635169,PT,S6690478,Microliter/mL,A9410182,418342002

In [29]:
con.index

Index(['C0000039', 'C0000039', 'C0000052', 'C0000052', 'C0000052', 'C0000052',
       'C0000052', 'C0000097', 'C0000097', 'C0000102',
       ...
       'C4721335', 'C4721335', 'C4721336', 'C4721336', 'C4721337', 'C4721337',
       'C4721338', 'C4721338', 'C4721339', 'C4721340'],
      dtype='object', name='CUI', length=1434271)

In [31]:
# con.duplicated()

## Relation

### All reltionships

In [32]:
# query = "select CUI1, AUI1, REL, CUI2, AUI2, RELA, RG from umls.MRREL where SAB ='SNOMEDCT_US' AND DIR='Y' AND SUPPRESS='N'"
query = "select CUI1, AUI1, REL, CUI2, AUI2, RELA, RG from umls.MRREL where SAB ='SNOMEDCT_US'"


df = pd.read_sql_query(query, sql_engine)

In [33]:
# query = "SELECT * FROM umls.SRDEF WHERE rt = 'RL'"
# rel_type = pd.read_sql_query(query, sql_engine)

In [36]:
df.shape

(6190718, 7)

In [37]:
df.head()

       CUI1       AUI1 REL      CUI2       AUI2      RELA    RG
0  C1284747   A3432466  RB  C0459595   A3130328  has_part  None
1  C1288393   A3431311  RB  C1281153   A3431931  has_part  None
2  C1288399   A3431324  RB  C1281153   A3431931  has_part  None
3  C1289259   A3425984  RB  C0459595   A3130328  has_part  None
4  C1959776  A13013550  RB  C2603351  A27786098  has_part  None

## Remove duplicated relations

In [38]:
df = df.sort_values(by=['RG'])

In [39]:
df.head()

             CUI1       AUI1  REL      CUI2       AUI2     RELA RG
6        C2603351  A27786098   RN  C1959776  A13013550  part_of  0
3759085  C0447086   A3097920  CHD  C1282088  A22951576      isa  0
3759075  C0447031   A3097919  CHD  C0149576   A3731373      isa  0
3759073  C0447031   A3097919  CHD  C0226200   A3722596      isa  0
3759069  C0042381  A22802478  CHD  C1320855   A3905288      isa  0

In [40]:
df[df.duplicated(['CUI1', 'CUI2', 'RELA'])]

             CUI1       AUI1  REL      CUI2       AUI2         RELA    RG
3759104  C0409568   A3097989  CHD  C0409569  A22891912          isa     0
3759384  C0418375   A3098599  CHD  C0418379  A22899651          isa     0
3759237  C1960228  A22813344  CHD  C0031874  A22912648          isa     0
3758399  C0473360   A3096292  CHD  C0473360  A22939054          isa     0
3758395  C0473364   A3096285  CHD  C0473364  A22962767          isa     0
...           ...        ...  ...       ...        ...          ...   ...
6190684  C0053154   A3111883  PAR  C0009077   A2880045  inverse_isa  None
6190685  C0282052   A3095057  PAR  C0002680   A2878433  inverse_isa  None
6190686  C0700443   A3095058  PAR  C0002680   A2878433  inverse_isa  None
6190704  C0361904  A29487346  PAR  C2930749   A3657312  inverse_isa  None
6190712  C0357797   A3054202  PAR  C0030071   A2884983  inverse_isa  None

[1752158 rows x 7 columns]

In [41]:
df = df.drop_duplicates(['CUI1', 'CUI2', 'RELA'])

In [42]:
df.shape

(4438560, 7)

In [43]:
df.to_csv('relations.csv', index=None)

In [87]:
rel = pd.read_csv('relations.csv')

In [88]:
rel = rel.set_index(['CUI1', 'CUI2'])

In [99]:
rel = rel.sort_index()

In [101]:
rel.loc[('C0348025', 'C3697449')]

                       AUI1 REL       AUI2        RELA   RG
CUI1     CUI2
C0348025 C3697449  A3251309  RO  A23457357  has_access  0.0

In [102]:
rel.loc[rel.duplicated()==True]

Empty DataFrame
Columns: [AUI1, REL, AUI2, RELA, RG]
Index: []

In [103]:
rel['RELA'].value_counts()

isa                          523865
mapped_to                    113222
has_finding_site              88750
has_associated_morphology     61958
has_method                    59159
                              ...
has_process_output               11
temporally_related_to             7
has_dependent                     6
relative_to_part_of               2
has_inherent_location             1
Name: RELA, Length: 103, dtype: int64

## Semantic Type

In [44]:
# query = """
# select * from MRSTY where CUI in 
# (select distinct CUI from MRCONSO WHERE SUPPRESS='N' AND LAT = 'ENG' 
# AND TS = 'P' AND ISPREF = 'Y' AND SAB ='SNOMEDCT_US')
# """

query = """
select * from MRSTY where CUI in 
(select distinct CUI from MRCONSO WHERE SAB ='SNOMEDCT_US')
"""


df = pd.read_sql_query(query, sql_engine)

In [45]:
df.head()

        CUI   TUI       STN                           STY        ATUI    CVF
0  C0684279  T104  A1.4.1.2  Chemical Viewed Structurally  AT07863958  256.0
1  C0684298  T104  A1.4.1.2  Chemical Viewed Structurally  AT07863959  256.0
2  C0684300  T104  A1.4.1.2  Chemical Viewed Structurally  AT07863960  256.0
3  C0439864  T104  A1.4.1.2  Chemical Viewed Structurally  AT07863965  256.0
4  C0439865  T104  A1.4.1.2  Chemical Viewed Structurally  AT07863966  256.0

In [46]:
df = df[['CUI', 'TUI', 'STN', 'STY']]

In [47]:
df.head()

        CUI   TUI       STN                           STY
0  C0684279  T104  A1.4.1.2  Chemical Viewed Structurally
1  C0684298  T104  A1.4.1.2  Chemical Viewed Structurally
2  C0684300  T104  A1.4.1.2  Chemical Viewed Structurally
3  C0439864  T104  A1.4.1.2  Chemical Viewed Structurally
4  C0439865  T104  A1.4.1.2  Chemical Viewed Structurally

In [48]:
df.to_csv('data/semantype.csv', index=None)